OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1904.h
extern __at(0x0195) volatile __PMCON1bits_t PMCON1bits;

#define _RD                     0x01
#define _WR                     0x02
#define _WREN                   0x04
#define _WRERR                  0x08
#define _FREE                   0x10
#define _LWLO                   0x20
#define _CFGS                   0x40

//==============================================================================

extern __at(0x0196) __sfr PMCON2;
extern __at(0x0199) __sfr RC1REG;
extern __at(0x0199) __sfr RCREG;
extern __at(0x0199) __sfr RCREG1;
extern __at(0x019A) __sfr TX1REG;
extern __at(0x019A) __sfr TXREG;
extern __at(0x019A) __sfr TXREG1;
extern __at(0x019B) __sfr SP1BRG;

//==============================================================================
//        SP1BRGL Bits

extern __at(0x019B) __sfr SP1BRGL;

typedef struct
  {
  unsigned BRG0                 : 1;
  unsigned BRG1                 : 1;
  unsigned BRG2                 : 1;
  unsigned BRG3                 : 1;
  unsigned BRG4                 : 1;
  unsigned BRG5                 : 1;
  unsigned BRG6                 : 1;
  unsigned BRG7                 : 1;
  } __SP1BRGLbits_t;

extern __at(0x019B) volatile __SP1BRGLbits_t SP1BRGLbits;

#define _BRG0                   0x01
#define _BRG1                   0x02
#define _BRG2                   0x04
#define _BRG3                   0x08
#define _BRG4                   0x10
#define _BRG5                   0x20
#define _BRG6                   0x40
#define _BRG7                   0x80

//==============================================================================


//==============================================================================
//        SPBRG Bits

extern __at(0x019B) __sfr SPBRG;

typedef struct
  {
  unsigned BRG0                 : 1;
  unsigned BRG1                 : 1;
  unsigned BRG2                 : 1;
  unsigned BRG3                 : 1;
  unsigned BRG4                 : 1;
  unsigned BRG5                 : 1;
  unsigned BRG6                 : 1;
  unsigned BRG7                 : 1;
  } __SPBRGbits_t;

extern __at(0x019B) volatile __SPBRGbits_t SPBRGbits;

#define _SPBRG_BRG0             0x01
#define _SPBRG_BRG1             0x02
#define _SPBRG_BRG2             0x04
#define _SPBRG_BRG3             0x08
#define _SPBRG_BRG4             0x10
#define _SPBRG_BRG5             0x20
#define _SPBRG_BRG6             0x40
#define _SPBRG_BRG7             0x80

//==============================================================================


//==============================================================================
//        SPBRGL Bits

extern __at(0x019B) __sfr SPBRGL;

typedef struct
  {
  unsigned BRG0                 : 1;
  unsigned BRG1                 : 1;
  unsigned BRG2                 : 1;
  unsigned BRG3                 : 1;
  unsigned BRG4                 : 1;
  unsigned BRG5                 : 1;
  unsigned BRG6                 : 1;
  unsigned BRG7                 : 1;
  } __SPBRGLbits_t;

extern __at(0x019B) volatile __SPBRGLbits_t SPBRGLbits;

#define _SPBRGL_BRG0            0x01
#define _SPBRGL_BRG1            0x02
#define _SPBRGL_BRG2            0x04
#define _SPBRGL_BRG3            0x08
#define _SPBRGL_BRG4            0x10
#define _SPBRGL_BRG5            0x20
#define _SPBRGL_BRG6            0x40
#define _SPBRGL_BRG7            0x80

//==============================================================================


//==============================================================================
//        SPBRGL1 Bits

extern __at(0x019B) __sfr SPBRGL1;

typedef struct
  {
  unsigned BRG0                 : 1;
  unsigned BRG1                 : 1;
  unsigned BRG2                 : 1;
  unsigned BRG3                 : 1;
  unsigned BRG4                 : 1;
  unsigned BRG5                 : 1;
  unsigned BRG6                 : 1;
  unsigned BRG7                 : 1;
  } __SPBRGL1bits_t;

extern __at(0x019B) volatile __SPBRGL1bits_t SPBRGL1bits;

#define _SPBRGL1_BRG0           0x01
#define _SPBRGL1_BRG1           0x02
#define _SPBRGL1_BRG2           0x04
#define _SPBRGL1_BRG3           0x08
#define _SPBRGL1_BRG4           0x10
#define _SPBRGL1_BRG5           0x20
#define _SPBRGL1_BRG6           0x40
#define _SPBRGL1_BRG7           0x80

//==============================================================================


//==============================================================================
//        SP1BRGH Bits

extern __at(0x019C) __sfr SP1BRGH;

typedef struct
  {
  unsigned BRG8                 : 1;
  unsigned BRG9                 : 1;
  unsigned BRG10                : 1;
  unsigned BRG11                : 1;
  unsigned BRG12                : 1;
  unsigned BRG13                : 1;
  unsigned BRG14                : 1;
  unsigned BRG15                : 1;
  } __SP1BRGHbits_t;

extern __at(0x019C) volatile __SP1BRGHbits_t SP1BRGHbits;

#define _BRG8                   0x01
#define _BRG9                   0x02
#define _BRG10                  0x04
#define _BRG11                  0x08
#define _BRG12                  0x10
#define _BRG13                  0x20
#define _BRG14                  0x40
#define _BRG15                  0x80

//==============================================================================


//==============================================================================
//        SPBRGH Bits

extern __at(0x019C) __sfr SPBRGH;

typedef struct
  {
  unsigned BRG8                 : 1;
  unsigned BRG9                 : 1;
  unsigned BRG10                : 1;
  unsigned BRG11                : 1;
  unsigned BRG12                : 1;
  unsigned BRG13                : 1;
  unsigned BRG14                : 1;
  unsigned BRG15                : 1;
  } __SPBRGHbits_t;

extern __at(0x019C) volatile __SPBRGHbits_t SPBRGHbits;

#define _SPBRGH_BRG8            0x01
#define _SPBRGH_BRG9            0x02
#define _SPBRGH_BRG10           0x04
#define _SPBRGH_BRG11           0x08
#define _SPBRGH_BRG12           0x10
#define _SPBRGH_BRG13           0x20
#define _SPBRGH_BRG14           0x40
#define _SPBRGH_BRG15           0x80

//==============================================================================


//==============================================================================
//        SPBRGH1 Bits

extern __at(0x019C) __sfr SPBRGH1;

typedef struct
  {
  unsigned BRG8                 : 1;
  unsigned BRG9                 : 1;
  unsigned BRG10                : 1;
  unsigned BRG11                : 1;
  unsigned BRG12                : 1;
  unsigned BRG13                : 1;
  unsigned BRG14                : 1;
  unsigned BRG15                : 1;
  } __SPBRGH1bits_t;

extern __at(0x019C) volatile __SPBRGH1bits_t SPBRGH1bits;

#define _SPBRGH1_BRG8           0x01
#define _SPBRGH1_BRG9           0x02
#define _SPBRGH1_BRG10          0x04
#define _SPBRGH1_BRG11          0x08
#define _SPBRGH1_BRG12          0x10
#define _SPBRGH1_BRG13          0x20
#define _SPBRGH1_BRG14          0x40
#define _SPBRGH1_BRG15          0x80

//==============================================================================


//==============================================================================
//        RC1STA Bits

